// Задача №1
// Баланс користувача зберігається у змінній balanse
// Сума покупки зберігається у змінній payment

// Перед перевіркою вивсти повідомлення:
// - "Загальна вартість товару замовлення [число] кредитів.
//     Перевіряєм кількість доступних коштів на рахунку"

// - Ящо сума покупки не перевищує баланс:
//      - Вирахувати із баланмса суму покупки
//      - Вивести повідомлення
//      "На рахунку залишилось [число] кредитів"

// - Якщо сума покупки перевищує баланс:
//      -Вивести повідомлення
//      "На рахунку не достатньо коштів для проведення операції!"

// - В кінці вивести повідомлення
//      "Операція завершена"

// let balanse = 25000;
// const payment = 5000;

// .....................
// Задача№ 2
// спочатку if else
// потым switch ()

// Напишіть скрипт вибору вартості готелю по кількості зірок
// 1 - 20$, 2 - 30$, 3 - 50$,  4- 70$, 5 -120$
//Якщо у змінній stars щось інше від чисел 1-5,
// виведи строку
// "Такої кількості зірок немає"

// ..............................
// Задача № 3
// Напиши скрипт вибору оцінки доставки товару
// Опція зберігається у змінній
// option: 1 - самовивіз, 2 - курєр, 3 - пошта

// У змінну message записати повідломлення
//  в залежності від опції
// - "Ви можете забрати товар завтра з 12:00 у нашому офісі"
// - "Курєр доставить замовлення завтра з 9:00 до 18:00"
// - "Посилка буде відправлена сьогодні"
// - "Вам передзвонить менеджер"

// .........................
// Задача №4 робимо разом

// Напиши код який шукає найменше число в масиві
// const numbers = [2, 17, 94, 1, 23, 37];

// .......................
// Задача № 5
// Напиши цикл for який виводить в консоль
// браузера числа по збільшенню від min до max.
// const max = 100;
// const min = 20;

// ...................
// Методи масивів

// plit() join() reverse()
// Задача  № 6
// Перевірити чи наша строка являється – паліндромом.
// const str = "ротатор";
// const newString = "коробка";

// ........................
// Задача № 7.1
//  - Створити масив styles з елементами «Шоколад» і «Торт».

// ....................
// Метод push()
// Задача № 7.2

// - Добавте «Тістечко» в кінець.

// .......................
// метод splice()
// Задача № 7.3

// - Замініть значення елемента в середині на «Кола».

// .........................
//метод shift()
// Задача № 7.4

// - Видаліть перший елемент і виведіть його в консоль.

// ........................
// метод unshift()
// Задача № 7.5

// - Вставте «Цукерки» и «Печиво» на початок масива.

// ..........................
// Задача № 7.6
//  - Видаліть перший елемент і збережіть його у змінну для подальшого використання
//  Виведіть видалений елемент в консоль.
